logs/cambiar-theme-color.org

#+TITLE: Cambiar Theme-color via javascript
#+DATE: [2021-08-23 lun]

#+SETUPFILE: ~/.emacs.d/template/html.org
#+EXPORT_FILE_NAME: ../tmp/theme-color.html

* theme-color meta tag
Sí tienes una android y usas chrome, sabras que la barra que contiene la direccion cambia de color en algunos sitios esto se puede lograr mediante el meta [[https://developer.mozilla.org/en-US/docs/Web/HTML/Element/meta/name/theme-color][theme-color]], Sin embargo sí eres como yo y nunca puedes terminar de decidir como se va a ver tu pagina estaras deacuerdo que editar individualmente cada pagina en html es algo tardado, entonces hare un pequeño tutorial de como cambiar el valor de el meta theme color

* Ajustes previos
Primero es necesario que nuestra pagina cuente con el meta theme-color, ya que solo lo podemos modificar, pero no lo podemos agregar con javascript:

#+BEGIN_EXAMPLE
<meta name="theme-color" content="#fff">
#+END_EXAMPLE

* Código
Ahora, para modificar el color simplemente añadimos este script a nuestro =script.js= y cualquier pagina que contenta el meta theme-color y el el titulo deberia cambiar de color 

#+BEGIN_EXAMPLE
document.querySelector("meta[name=theme-color]").setAttribute("content", "#ff0000"); <- aquí va tu color
#+END_EXAMPLE

[[https://gordonlesti.com/change-theme-color-via-javascript/][Más informacion]] 
